site/output/posts/computer-vision-workshop-at-ubc/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Links to download and install Anaconda and OpenCV | Yours Geekly</title>
<link href="../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../rss.xml">
<link rel="canonical" href="http://mpslxz.github.io/posts/computer-vision-workshop-at-ubc/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="mpslxz">
<link rel="prev" href="../which-keyboard-layout-is-the-best-for-you/" title="Which keyboard layout is the best for you?" type="text/html">
<link rel="next" href="../tramp/" title="Tramp: A great tool for remote code development." type="text/html">
<meta property="og:site_name" content="Yours Geekly">
<meta property="og:title" content="Links to download and install Anaconda and OpenCV">
<meta property="og:url" content="http://mpslxz.github.io/posts/computer-vision-workshop-at-ubc/">
<meta property="og:description" content="Hi Everyone,



Firstly, I want to say thank you guys for registering for the CV workshop. This is going to be an introductory workshop to opencv, which is one of the most popular libraries for comput">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-09-06T21:50:53-07:00">
<meta property="article:tag" content="computer vision">
<meta property="article:tag" content="opencv">
<meta property="article:tag" content="python">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="http://mpslxz.github.io/">

                <span id="blog-title">Yours Geekly</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../archive.html">Archive</a>
                </li>
<li>
<a href="../../categories/">Tags</a>
                </li>
<li>
<a href="../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Links to download and install Anaconda and OpenCV</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    mpslxz
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-09-06T21:50:53-07:00" itemprop="datePublished" title="2017-09-06 21:50">2017-09-06 21:50</time></a></p>
                <p class="commentline">
        
    <a href="#disqus_thread" data-disqus-identifier="cache/posts/computer-vision-workshop-at-ubc.html">Comments</a>


            

        </p>
</div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <p>
Hi Everyone,
</p>

<p>
Firstly, I want to say thank you guys for registering for the CV workshop. This is going to be an introductory workshop to opencv, which is one of the most popular libraries for computer vision and image processing. Although opencv has different interfaces for different languages, we will use python throughout the workshop. The reason that I chose python is: 
</p>
<ol class="org-ol">
<li>at this point you've had a couple of python programming courses/workshops so you are fairly familiar with python, 
</li>
<li>python is intuitive and easy to use, 
</li>
<li>we will jupyter notebooks along with the normal python files (.py) to test and see immediate results. As you know, the notebooks provide an interactive environment, which is a plus.
</li>
</ol>
<p>
The software packages that we are going to use are:
</p>
<ol class="org-ol">
<li>Anaconda for python 2.7, to have necessary python packages installed
</li>
<li>OpenCV 3
</li>
<li>Your editor/IDE of choice like PyCharm. Personally, I use Emacs but it does not mean that you need to use it as well.
</li>
</ol>
<p>
I am going to put all of the download links and also installation documents in this post. Just please make sure that you download and install Anaconda for python 2.7 and opencv3.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">PyCharm</h2>
<div class="outline-text-2" id="text-1">
<p>
If you want to use PyCharm as your IDE, you can find the download it and find the instructions <a href="https://www.jetbrains.com/pycharm/download/">here</a>. 
</p>

<p>
<b>Tip: You can register as a student and get the professional version of PyCharm for free.</b>
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Anadonda for Windows:</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>
<a href="https://repo.continuum.io/archive/Anaconda2-5.0.1-Windows-x86_64.exe">Download from here</a>
</li>
<li>
<a href="https://docs.anaconda.com/anaconda/install/windows">How to install</a> 
</li>
</ul>
<p>
<b>NOTE:</b> Remember where you install Anaconda. You are going to need it when installing OpenCV. Let's call it <code>ANACONDA_FOLDER</code>
</p>

<p>
<b>NOTE:</b> Check the box where it says "Add Anaconda to my PATH variable". If you have already installed a python version, this will replace the current Anacanda version with the previous one.
</p>
</div>
</div>


<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Anaconda for GNU/Linux:</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>
<a href="https://repo.continuum.io/archive/Anaconda2-5.0.1-Linux-x86_64.sh">Download from here</a>
</li>
<li>
<a href="https://docs.anaconda.com/anaconda/install/linux">How to install</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Anaconda for MacOS:</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>
<a href="https://repo.continuum.io/archive/Anaconda2-5.0.1-MacOSX-x86_64.sh">Download from here</a>
</li>
<li>
<a href="https://docs.anaconda.com/anaconda/install/mac-os">How to install</a>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">OpenCV3:</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">For Windows</h3>
<div class="outline-text-3" id="text-5-1">
<ol class="org-ol">
<li>Go to <a href="https://opencv.org/releases.html">the opencv download page</a> and download version 3.1.0 for Windows. 
</li>
<li>Click and extract the downloaded file.
</li>
<li>Go to <code>opencv\build\python\2.7</code> folder.
</li>
<li>Copy <code>cv2.pyd</code> to <code>ANACONDA_FOLDER\lib\site_packages</code>.
</li>
<li>Done!
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">For GNU/Linux and MacOS:</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Open a terminal window.
</li>
<li>Type <code>conda install -c menpo opencv3</code>
</li>
<li>Done!
</li>
</ol>
<p>
That's it for now. See you at the workshop. 
</p>
</div>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../categories/computer-vision/" rel="tag">computer vision</a></li>
            <li><a class="tag p-category" href="../../categories/opencv/" rel="tag">opencv</a></li>
            <li><a class="tag p-category" href="../../categories/python/" rel="tag">python</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../which-keyboard-layout-is-the-best-for-you/" rel="prev" title="Which keyboard layout is the best for you?">Previous post</a>
            </li>
            <li class="next">
                <a href="../tramp/" rel="next" title="Tramp: A great tool for remote code development.">Next post</a>
            </li>
        </ul></nav></aside><section class="comments hidden-print"><h2>Comments</h2>
        
        
        <div id="disqus_thread"></div>
        <script>
        var disqus_shortname ="mpslxz-github-io",
            disqus_url="http://mpslxz.github.io/posts/computer-vision-workshop-at-ubc/",
        disqus_title="Links to download and install Anaconda and OpenCV",
        disqus_identifier="cache/posts/computer-vision-workshop-at-ubc.html",
        disqus_config = function () {
            this.language = "en";
        };
        (function() {
            var dsq = document.createElement('script'); dsq.async = true;
            dsq.src = 'https://' + disqus_shortname + '.disqus.com/embed.js';
            (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
        })();
    </script><noscript>Please enable JavaScript to view the <a href="https://disqus.com/?ref_noscript" rel="nofollow">comments powered by Disqus.</a>
</noscript>
    <a href="https://disqus.com" class="dsq-brlink" rel="nofollow">Comments powered by <span class="logo-disqus">Disqus</span></a>


        </section></article><script>var disqus_shortname="mpslxz-github-io";(function(){var a=document.createElement("script");a.async=true;a.src="https://"+disqus_shortname+".disqus.com/count.js";(document.getElementsByTagName("head")[0]||document.getElementsByTagName("body")[0]).appendChild(a)}());</script>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2018         <a href="mailto:">mpslxz</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(2, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
